import Link from "next/link";

export default function HomePage() {
  return (
    <div className="grid2">
      <section className="card">
        <h3 className="h1">Танин мэдэхүй-сэтгэл хөдлөлийн зохицуулалтын асуулга (CERQ), 
  Темпераментийн хэмжүүр (OSPP), 
  Сонгох хариу үйлдлийн хугацаа болон Stroop өнгөний тест</h3>

        <p className="p">
          Энэхүү вэбсайт нь 4 үе шаттай бөгөөд танин мэдэхүй-сэтгэл хөдлөлийн зохицуулалтын
  асуулга, темпераментийн хэмжүүр, 8 дэд хэсэг бүхий сонгох хариу үйлдлийн хугацааны
  дасгалууд болон Stroop өнгөний дасгалуудаас бүрдэнэ.
        </p>

        <div className="btnRow">
          <Link className="btn btnPrimary" href="/test">Тест эхлэх</Link>
        </div>

        <hr className="hr" />

        <p className="smallNote">
          Хариултыг <span className="kbd">←</span> болон <span className="kbd">→</span> товчоор өгөх
          (эсвэл дэлгэцийн товчлуурууд дээр дарж болно).
        </p>
      </section>

      <aside className="card">
        <h2 className="h2">Юу хэмжигдэх вэ?</h2>

        <p className="p">
  CERQ тест нь танин мэдэхүйн зохицуулалтыг ашиглах байдлаар сэтгэл хөдлөлөө хэрхэн
  үр дүнтэй удирдаж байгааг тодруулах зорилготой. Темпераментийн хэмжүүр нь хувь хүний
  сэтгэл хөдлөл, хариу үйлдлийн онцлог байдлыг үнэлнэ. Сонгох хариу үйлдлийн хугацаа
  болон Stroop өнгөний дасгалууд хариу үйлдлийн хугацаа, түүний оновчтой байдал
  зэргийг үнэлэх бөгөөд уг даалгаврыг ажиллахдаа аль болох хурдан сонгох нь чухал юм.
</p>
      </aside>
    </div>
  );
}